{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 1\n",
    "Даны 2 переменных, в которых хранятся строки произвольной длины: phrase_1 и phrase_2.\n",
    "Напишите код, который проверяет какая из этих строк длиннее."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = 'fgfg'\n",
    "b = 'sfdf'\n",
    "\n",
    "if len(a)>len(b):\n",
    "    print(\"Строка a Длиннее\")\n",
    "elif len(a)<len(b): \n",
    "    print(\"Строка b Длиннее\")\n",
    "else: \n",
    "    print(\"Строки равной длины\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 2\n",
    "Дана переменная, в которой хранится четырехзначное число (год). Необходимо написать программу, которая выведет, является ли данный год високосным или обычным."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = int(input('Введите год '))\n",
    "b = 2020\n",
    "if (a-b)%4==0:\n",
    "    print('Год ', a, ' високосный')\n",
    "else:\n",
    "    print ('Год ', a, ' не високосный')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 3\n",
    "Необходимо написать программу, которая будет запрашивать у пользователя месяц и дату рождения и выводить соответствующий знак зодиака."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = input('Введите дату рождения: ')\n",
    "c=0\n",
    "while True:\n",
    "    if (a.isnumeric() and 32>int(a)>0):\n",
    "        b = str(input('Введите месяц рождения: '))\n",
    "        b=b.lower()\n",
    "        break\n",
    "    else: \n",
    "        a = input('Введите дату корректно: число в диапазоне от 1 до 31 ')\n",
    "        \n",
    "while True:\n",
    "    if (b=='январь' or b=='01'):\n",
    "        b='01-'+a\n",
    "        print ('Дата рождения: ', b)\n",
    "        break\n",
    "        \n",
    "    elif (b=='февраль' or b=='02'):\n",
    "        b='02-'+a\n",
    "        print ('Дата рождения ', b)\n",
    "        break    \n",
    "    else:\n",
    "        b = str(input('Введите месяц рождения корректно'))\n",
    "        \n",
    "if (b>'01-01'  and  b<'02-01'):\n",
    "    print('По гороскопу ты дятел')\n",
    "    \n",
    "elif (b>'02-01'  and  b<'03-01'):\n",
    "    print('По гороскопу ты кукушка')\n",
    "else:\n",
    "    print('Я только до февраля сделал')\n",
    "\n",
    "    \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 4\n",
    "Вам нужно написать программу для подбора упаковок по размерам товара. Размеры хранятся в переменных (в сантиметрах):\n",
    "width = 10\n",
    "length = 205\n",
    "height = 5\n",
    "Используйте следующие правила:\n",
    "\n",
    "если каждое из трех измерений менее 15 сантиметров, то выведите на экран “Коробка №1”;\n",
    "если хотя бы одно из измерений больше 15 сантиметров, но менее 50 сантиметров, то выводите “Коробка №2”;\n",
    "если длина товара больше 2 метров, то выводите “Упаковка для лыж”;\n",
    "во всех остальных случаях выводите “Стандартная коробка №3”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "d=0\n",
    "a = input('Введите  ширину в см: ')\n",
    "b = input('Введите  длину в см: ')\n",
    "c = input('Введите  высоту в см: ')\n",
    "while True:\n",
    "    if (a.isnumeric() and b.isnumeric() and c.isnumeric()):\n",
    "        a=int(a)\n",
    "        b=int(b)\n",
    "        c=int(c)\n",
    "        break\n",
    "    else:\n",
    "        print('Вводить можно только числа')\n",
    "        a = input('Введите  ширину в см: ')\n",
    "        b = input('Введите  длину в см: ')\n",
    "        с = input('Введите  высоту в см: ')\n",
    "    \n",
    "if (a>200 or b>200 or c>200):\n",
    "    print('Упаковка для лыж')\n",
    "elif (a<=15 and b<=15 and c<=15):\n",
    "    print('Коробка№1')\n",
    "elif (15<a<=50 and 15<b<=50  and 15<c<=50):\n",
    "    print('Коробка№2')\n",
    "else:\n",
    "    print('Коробка№3')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Задача 5\n",
    "Дана переменная, в которой хранится шестизначное число (номер проездного билета). Напишите программу, которая будет определять, является ли данный билет “счастливым”. Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#не делаю проверку на число\n",
    "a=str(input('Введите номер билета :'))\n",
    "if (int(a[1])+int(a[2])+int(a[3]))==(int(a[4])+int(a[5])+int(a[5])): \n",
    "    print('Билет счастливый')\n",
    "else: \n",
    "    print('Билет несчастливый')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 6\n",
    "Напишите программу, которая сможет вычислять площади трех фигур (круг, треугольник и прямоугольник). Тип фигуры запрашиваем через пользовательский ввод, после чего делаем запрос характеристик фигуры:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Назовите фигуру: круг, квадрат или треугольник: треугольник\n",
      "Введите сторону 1 в см: 1\n",
      "Введите сторону 2 в см: 1\n",
      "Введите сторону 3 в см: 1\n",
      "Площадь треугольника равна:  0.4330127018922193\n"
     ]
    }
   ],
   "source": [
    "import math\n",
    "while True:\n",
    "    a=input('Назовите фигуру: круг, квадрат или треугольник: ')\n",
    "    a=a.lower()\n",
    "    if a=='круг':\n",
    "        r=int(input('Введите радиус в см: '))\n",
    "        print('Площадь круга равна: ', math.pi*(r**2))\n",
    "        break\n",
    "    elif a=='квадрат':\n",
    "        r=int(input('Введите сторону в см: '))\n",
    "        print('Площадь квадрата равна: ', r**2)\n",
    "        break\n",
    "    elif a=='треугольник':\n",
    "        st1=int(input('Введите сторону 1 в см: '))\n",
    "        st2=int(input('Введите сторону 2 в см: '))\n",
    "        st3=int(input('Введите сторону 3 в см: '))\n",
    "        p=(st1+st2+st3)/2\n",
    "        print('Площадь треугольника равна: ', (p*(p-st1)*(p-st2)*(p-st3))**0.5)\n",
    "        break\n",
    "        \n",
    "    else:\n",
    "        print('Введите фигуру из списка')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
